import re

allFoodDict = {
    "곰탕": "D018056",
    "도토리묵": "D018346",
    "콩나물국": "D018103",
    "비빔밥": "D018204",
    "연근조림": "D018450",
    "두부조림": "D018436",
    "브로콜리": "R000988",
    "불고기": "D018039",
    "배추김치": "D018116",
    "된장찌개": "D018480",
    "조미김": "D018045",
    "식빵": "D018312",
    "후라이드치킨": "D018547",
    "계란프라이": "P035755",
    "김밥": "D018190",
    "햄구이": "D018052",
    "고등어구이": "D018018",
    "짜장면": "D018180",
    "메추리알장조림": "D018439",
    "잡곡밥": "D018220",
    "칼국수": "D018183",
    "김치볶음밥": "D018192",
    "김치전": "D018401",
    "김치찌개": "D000385",
    "깍두기": "D018111",
    "깻잎": "R000853",
    "상추": "R001016",
    "단무지": "D018389",
    "피자": "D000297",
    "라면": "D018163",
    "쌀밥": "R000062",
    "콩나물무침": "D018152",
    "양념치킨": "D000475",
    "미역국": "D018071",
    "설렁탕": "D018083",
    "간장": "P014894",
    "시금치나물": "D018141",
    "멸치볶음": "D018263",
    "제육볶음": "D018288",
    "오이소박이": "D018123",
    "수육": "D018516",
    "고구마": "R000452",
    "토마토": "R001224",
    "떡볶이": "D018256",
    "육개장": "D018099",
}

def check_food_code(food_name):
    # 정규식을 사용하여 알파벳 대문자 + 숫자 여섯 자리 패턴을 찾는다
    match = re.search(r"[A-Z]\d{6}", food_name)
    
    if match:
        return match.group()
    else:
        # 만약 정규식에 부합하지 않는다면 그대로 돌려보낸다
        food_name = ''.join([i for i in food_name if not i.isdigit()])
        food_code = allFoodDict.get(food_name)

        # print(food_code)
        if food_code is not None:
            return food_code